package am;
public class Exam1 {
    public static void main(String[] args) {
        /*자료형 - 프로그래밍의 기본은 데이터를 저장하고 그 값을 읽어오는 것이다.
        데이터를 저장하려면 메모리에 값을 저장할 공간을 생성하고 이름을 부여해야한다. 
        이때 메모리에 부여하는 이름을 '변수' 라고 한다.
        사물함에 물건을 쉽게 저장하고 꺼내오려면 사물함 번호가 있으면 물건을 찾기가
        수월하다. 마치 사물함의 번호가 바로 변수라고 보면 된다.
        데이터를 저장하기 위해 생성하는 메모리 공간은 목적에 따라 크기과 특징이 다르다.
        이것을 자료형 data type 이라고 한다. 
        메모리 공간의 자료형에 따라 저장할 수 있는 값의 종류와 특징이 결정된다.

        C나 자바와 같은 컴파일 언어는 변수를 사용하기 전에 반드시 자료형을 선언해야 한다.

        int a; a는 정수형 변수이다
        String b; b는 문자열 변수이다

        2 가지 주의사항
        1. 자료형은 반드시 사용하기 전에 선언한다.
        2. 자료형은 반드시 한 번만 선언한다. 한번 선언된 변수의 자료형은 바꿀 수 없다.

        int a = 3;
        b = 5; // 자료형을 선언하지 않으면 사용이 불가능 하다
        
        String c;
        c = "안녕"; 
        */

        int a = 3;
        int b;
        b = 4;
        System.out.println(a+" "+b);
    }
}
